# 表达式是值和操作符的组合
# python常见数据类型为:整型 浮点型 字符串
#  常见数据类型示例: 
#  整型: -1, 0, 1, 2, 3 ...
#  浮点型: -1.25, -1.0, 0.0, 0.5, 1.0, 1.25
#  字符串: 'a', 'aa', 'Hello', '11'

# 字符串连接和复制
# 根据操作符前后的数据类型,操作符含义可能会改变
# 例如:+操作符两边是整型或浮点型时,是相加操作符,当为两个字符串时,是字符串连接符
print("+号两边为数值类型时,5+5 is:", 5+5)

def test():
      try:
            'hdfs' + 5
      except TypeError:
            print(TypeError)
            return "请保持操作符两边为相同类型"


print("+号两边为不同类型时,hdfs+5 is:", test())
# 可以在控制台看到有TypeError输出

# +操作符两边都为字符串类型时
print("+操作符两边都为字符串类型时, Hello  + world! is: ", 'Hello ' + 'world!')

# *号操作符作乘法操作符时,两边需为数值类型,
# *号操作符做复制操作符时,两边须为一个字符串和一个整型
print("*号操作符作乘法操作符时,两边需为数值类型, 5*5 is: ", 5*5)
print("*号操作符做复制操作符时,两边须为一个字符串和一个整型, str * 5 is: ", 'str'*5)


